# NoRotateMirrorZError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..NoRotateMirrorZError Property
BuiltInFailures..::..EditingFailures Class See Also
---
Element cannot be mirrored or rotated in a manner that changes its angle relative to the ground.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoRotateMirrorZError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoRotateMirrorZError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoRotateMirrorZError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace